public enum EResource
{               // Взято из планетарных боёв Космических Рейнджеров + Money
    Money,      // Деньги - основной ресурс для использования вне боя (улучшение базы etc.)
    Titanium,   // Титан - самый важный.Без него не собрать даже плохонького робота (не говоря уже о турели).
    Battery,    //Батареи - вторые по важности.Они нужны для лучших корпусов и шасси, ремонтников и некоторых видов оружия.
    Chips,      //Чипы почти так же важны, как и батареи, обычно они идут "рука об руку". Помогают усилить робота.
    Plasma      //Плазма - без неё часто можно обойтись, но самого сильного робота не соберёшь.
}